{"format": "layers-model", "generatedBy": "keras v2.3.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.3.0", "backend": "tensorflow", "model_config": {"config": {"name": "sequential_2", "layers": [{"config": {"kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "dense_5", "activity_regularizer": null, "batch_input_shape": [null, 16], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "use_bias": true, "units": 50, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "dtype": "float32", "name": "dropout_2", "rate": 0.3, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "dense_6", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "use_bias": true, "units": 100, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "dense_7", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "use_bias": true, "units": 50, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "sigmoid", "kernel_regularizer": null, "name": "dense_8", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "use_bias": true, "units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "training_config": {"metrics": ["binary_accuracy", {"config": {"name": "recall_12", "top_k": null, "class_id": null, "dtype": "float32", "thresholds": [0.3]}, "class_name": "Recall"}], "loss_weights": null, "loss": "binary_crossentropy", "weighted_metrics": null, "sample_weight_mode": null, "optimizer_config": {"config": {"learning_rate": 9.999999747378752e-05, "momentum": 0.0, "decay": 0.0, "nesterov": false}, "class_name": "SGD"}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_5/kernel", "shape": [16, 50], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [50, 100], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [100, 50], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [50, 1], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [1], "dtype": "float32"}]}]}