{"format": "layers-model", "generatedBy": "keras v2.3.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.3.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"activation": "relu", "units": 50, "name": "dense_5", "batch_input_shape": [null, 16], "bias_regularizer": null, "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "use_bias": true, "trainable": true, "units": 100, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_7", "use_bias": true, "trainable": true, "units": 50, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_8", "use_bias": true, "trainable": true, "units": 1, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}], "name": "sequential_2"}}, "training_config": {"loss_weights": null, "loss": "mse", "sample_weight_mode": null, "weighted_metrics": null, "metrics": ["mean_absolute_percentage_error"], "optimizer_config": {"class_name": "SGD", "config": {"decay": 0.0, "momentum": 0.0, "learning_rate": 0.10000000149011612, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_5/kernel", "shape": [16, 50], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [50, 100], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [100, 50], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [50, 1], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [1], "dtype": "float32"}]}]}