{"format": "layers-model", "generatedBy": "keras v2.3.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.3.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"activation": "relu", "units": 50, "name": "dense_1", "batch_input_shape": [null, 16], "bias_regularizer": null, "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"dtype": "float32", "rate": 0.3, "seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "use_bias": true, "trainable": true, "units": 100, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "use_bias": true, "trainable": true, "units": 50, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "use_bias": true, "trainable": true, "units": 1, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}], "name": "sequential_1"}}, "training_config": {"loss_weights": null, "loss": "binary_crossentropy", "sample_weight_mode": null, "weighted_metrics": null, "metrics": ["binary_accuracy", {"class_name": "Recall", "config": {"thresholds": [0.3], "dtype": "float32", "top_k": null, "class_id": null, "name": "recall_1"}}], "optimizer_config": {"class_name": "SGD", "config": {"decay": 0.0, "momentum": 0.0, "learning_rate": 9.999999747378752e-05, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [16, 50], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [50, 100], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [100, 50], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [50, 1], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [1], "dtype": "float32"}]}]}